Ran Plan for dir: `dev/us-east-2` workspace: `default`

<details><summary>Show Output</summary>

```diff
data.aws_ami.atlantis: Reading...
data.aws_ami.atlantis: Read complete after 1s [id=ami-0649bea3443ede307]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_iam_instance_profile.atlantis will be created
+ resource "aws_iam_instance_profile" "atlantis" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "dev-atlantis"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "dev-atlantis"
      + tags_all    = {
          + "Environment" = "DEV"
          + "Project"     = "Atlantis"
        }
      + unique_id   = (known after apply)
    }

  # aws_iam_role.atlantis will be created
+ resource "aws_iam_role" "atlantis" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dev-atlantis"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "DEV"
          + "Project"     = "Atlantis"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.atlantis_admin will be created
+ resource "aws_iam_role_policy_attachment" "atlantis_admin" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + role       = "dev-atlantis"
    }

  # aws_instance.atlantis will be created
+ resource "aws_instance" "atlantis" {
      + ami                                  = "ami-0649bea3443ede307"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.medium"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "deployer-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-0fd906853c4f93bf8"
      + tags                                 = {
          + "Name" = "dev-atlantis-server"
        }
      + tags_all                             = {
          + "Environment" = "DEV"
          + "Name"        = "dev-atlantis-server"
          + "Project"     = "Atlantis"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "a117aeb8566d3ccfbdb619f301dcda7b8c4d2da1"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = true
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 2
          + http_tokens                 = "optional"
          + instance_metadata_tags      = "enabled"
        }

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device (known after apply)
    }

  # aws_key_pair.atlantis will be created
+ resource "aws_key_pair" "atlantis" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "deployer-key"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDl1vz2GLroKGBiQmtHx/lLOotslVExsCMS38MsjB1wO48sNlgQvoZRG+QMqn3TrbaTBC6DPMdKiGae3VPpiTKNQC38GepXfNOH+Sf7Fpv0uwLJu1XVr1KT2oSZzaVvI/xoXUjYOZcYaazwXhqpLOAxdp00B/XmsMLH+9mZZoYE1EvV9I3L1O7tzuAI/Z/PMtvTD8fIWkHhlDI68viBQNWehZAOsjlUG3UVgdnjs6jMuLwI0w5TFuY3y6jhj5eGcCsR++TV96phJgze9Ak4p/rbb7NcwGXUOGgizXI9CRYF6u/kdHZe9yBvChMzIm3/TiQ9XZC8bRi8mHGq9kk27Pf7"
      + tags_all        = {
          + "Environment" = "DEV"
          + "Project"     = "Atlantis"
        }
    }

  # aws_security_group.atlantis will be created
+ resource "aws_security_group" "atlantis" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "atlantis"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "Environment" = "DEV"
          + "Project"     = "Atlantis"
        }
      + vpc_id                 = "vpc-01899f3c4daef3226"
    }

  # aws_vpc_security_group_egress_rule.allow_everywhere will be created
+ resource "aws_vpc_security_group_egress_rule" "allow_everywhere" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {
          + "Environment" = "DEV"
          + "Project"     = "Atlantis"
        }
    }

  # aws_vpc_security_group_ingress_rule.allow_atlantis_admin_everywhere will be created
+ resource "aws_vpc_security_group_ingress_rule" "allow_atlantis_admin_everywhere" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + from_port              = 4141
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {
          + "Environment" = "DEV"
          + "Project"     = "Atlantis"
        }
      + to_port                = 4141
    }

  # aws_vpc_security_group_ingress_rule.allow_ssh_everywhere will be created
+ resource "aws_vpc_security_group_ingress_rule" "allow_ssh_everywhere" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + from_port              = 22
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {
          + "Environment" = "DEV"
          + "Project"     = "Atlantis"
        }
      + to_port                = 22
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ public_ip = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d dev/us-east-2
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://18.118.33.238:4141/lock?id=luismiguelsaez%252Fterraform-serverless%252Fdev%252Fus-east-2%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d dev/us-east-2
  ```
Plan: 9 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```